{"id":2724,"date":"2025-06-09T11:49:53","date_gmt":"2025-06-09T10:49:53","guid":{"rendered":"https:\/\/leahall.fet.ac\/?page_id=2724"},"modified":"2025-06-24T17:28:56","modified_gmt":"2025-06-24T16:28:56","slug":"prevent","status":"publish","type":"page","link":"https:\/\/leahall.fet.ac\/parents\/safeguarding-2\/prevent\/","title":{"rendered":"Prevent"},"content":{"rendered":"\n<h3 class=\"wp-block-heading\">What is the Prevent Strategy?<\/h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Prevent is a government strategy designed to stop people becoming terrorists or supporting terrorist or extremist causes.<\/li>\n\n\n\n<li>The Prevent strategy covers all types of terrorism and extremism, including the extreme right wing, violent Islamist groups and other causes.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">How does the Prevent strategy apply to schools?<\/h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li>From July 2015 all schools (as well as other organisations) have a duty to safeguard children from radicalisation and extremism.<\/li>\n\n\n\n<li>This means we have a responsibility to protect children from extremist and violent views the same way we protect them from any other harm.<\/li>\n\n\n\n<li>Importantly, we can provide a safe place for pupils to discuss these issues, at an appropriate level so they better understand how to protect themselves.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">What does this mean in practice at Lea Hall Academy?<\/h3>\n\n\n\n<p>Many of the things we already do in school to help children become positive, happy members of society also contribute to the Prevent strategy. These include:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Having a strong Aims and Ethos which pervades our school.<\/li>\n\n\n\n<li>Focusing on core values.<\/li>\n\n\n\n<li>Exploring other cultures and religions and promoting diversity.<\/li>\n\n\n\n<li>Challenging prejudices and racist comments.<\/li>\n\n\n\n<li>Developing critical thinking skills and a strong, positive self-identity.<\/li>\n\n\n\n<li>Promoting the spiritual, moral, social and cultural development of pupils, as well as British values such as democracy.<\/li>\n<\/ul>\n\n\n\n<p>We will also protect children from the risk of radicalisation, for example by using filters on the internet to make sure they can’t access extremist and terrorist material, or by vetting visitors who come into school to work with pupils.<\/p>\n\n\n\n<p>Different schools will carry out the Prevent duty in different ways, depending on the age of the children and the needs of the community.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Isn’t my child too young to learn about extremism?<\/h3>\n\n\n\n<p>The Prevent strategy is not just about discussing extremism itself, which may not be appropriate for younger children. It is also about teaching children values such as tolerance and mutual respect. This is what we will focus on at Lea Hall Academy.<\/p>\n\n\n\n<p>The school will make sure any discussions are suitable for the age and maturity of the children involved.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Is extremism really a risk in our area?<\/h3>\n\n\n\n<p>Extremism can take many forms, including political, religious and misogynistic extremism. Some of these may be a bigger threat in our area than others.<\/p>\n\n\n\n<p>We will endeavour to give children the skills to protect them from any extremist views they may encounter, now or later in their lives.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Further information<\/h3>\n\n\n\n<p>Contact the school&nbsp;– If you have any questions or concerns about the Prevent Strategy and what it means for your child, please do not hesitate to contact the school.<\/p>\n\n\n\n<p>See our policies&nbsp;– You will find more details about radicalisation in our safeguarding policy, available on our website. We also have information about spiritual, moral, social and cultural development and British values.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">External sources – The following sources may also be useful for further information:<\/h3>\n\n\n\n<figure class=\"wp-block-embed\"><div class=\"wp-block-embed__wrapper\">\nhttps:\/\/www.birmingham.gov.uk\/the_prevent_duty\n<\/div><\/figure>\n\n\n\n<figure class=\"wp-block-embed\"><div class=\"wp-block-embed__wrapper\">\nhttps:\/\/www.gov.uk\/government\/publications\/prevent-duty-guidance\n<\/div><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>What is the Prevent Strategy? How does the Prevent strategy apply to schools? What does this mean in practice at Lea Hall Academy? Many of the things we already do in school to help children become positive, happy members of society also contribute to the Prevent strategy. These include: We will also protect children from the risk of radicalisation, for example by using filters on the internet to make sure they can’t access extremist and terrorist material, or by vetting [&hellip;]<\/p>\n","protected":false},"author":58,"featured_media":0,"parent":2008,"menu_order":2,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-2724","page","type-page","status-publish","hentry"],"acf":{"sidebar":true,"landing_page":false},"_links":{"self":[{"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/pages\/2724"}],"collection":[{"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/users\/58"}],"replies":[{"embeddable":true,"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/comments?post=2724"}],"version-history":[{"count":6,"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/pages\/2724\/revisions"}],"predecessor-version":[{"id":2755,"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/pages\/2724\/revisions\/2755"}],"up":[{"embeddable":true,"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/pages\/2008"}],"wp:attachment":[{"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/media?parent=2724"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}