{"id":51,"date":"2022-03-15T15:19:58","date_gmt":"2022-03-15T14:19:58","guid":{"rendered":"https:\/\/leahall.fet.creativeschools.co.uk\/medication-illness-in-school\/"},"modified":"2024-04-17T13:39:12","modified_gmt":"2024-04-17T12:39:12","slug":"medication-illness-in-school","status":"publish","type":"page","link":"https:\/\/leahall.fet.ac\/parents\/joining-the-school\/medication-illness-in-school\/","title":{"rendered":"Medication\/Illness in School"},"content":{"rendered":"\n<p>Bottles will need to be securely wrapped to avoid breakages. You may need to ask your doctor for an extra prescription so that adequate supplies may be kept in school.<\/p>\n\n\n\n<p>If your child becomes unwell at school, it may be necessary for them to go home. We ask that you provide the school with emergency contact details for this purpose. Also if your child is unwell or has an acute infection we ask that they remain at home as we do not have the facilities to care for sick children within the school.&nbsp; If we are advised that your child needs to be taken directly to hospital you will be notified immediately and arrangements made for ambulance transport.&nbsp; <strong>It is vitally important that we have two telephone contact numbers through which you may be contacted in the event of an emergency.<\/strong><\/p>\n\n\n\n<p>If your child has been sick or has had viral diarrhoea, we ask that they remain at home for at least 48 hours clear to ensure that the infection has cleared.<\/p>\n\n\n\n<p>If you have any medical concerns, you can also contact the school nurse directly.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">PLEASE DO NOT SEND YOUR CHILD TO SCHOOL IF THEY ARE UNWELL.<\/h3>\n\n\n\n<h2 class=\"wp-block-heading\">Accidental Injury in School<\/h2>\n\n\n\n<p>If your child sustains an accidental injury in school, our nurse\/first aiders will advise us on the best course of action to take. If the injury is minor, you will be informed by telephone or by text, email or letter sent home with your child. If the injury is more serious you will be informed immediately by telephone. Should your child need to be taken home or to hospital, arrangements will be made as described in the previous section above.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Continence Management Materials<\/h2>\n\n\n\n<p>If your child is using incontinence padding or nappies and you know that they will require to be changed during the school day, we would ask you please to send in a supply including wipes, sufficient to meet their needs- preferably each week.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If your child requires medication during the school day, it is important to ensure that adequate supplies are sent into school with a pharmacy label in place. A consent form will need to be signed and will require updating on a regular basis if there are any changes to medication.<br \/>\n(Forms can be obtained from the school)<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":47,"menu_order":2,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-51","page","type-page","status-publish","hentry"],"acf":{"sidebar":true,"landing_page":false},"_links":{"self":[{"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/pages\/51"}],"collection":[{"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/comments?post=51"}],"version-history":[{"count":3,"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/pages\/51\/revisions"}],"predecessor-version":[{"id":2117,"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/pages\/51\/revisions\/2117"}],"up":[{"embeddable":true,"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/pages\/47"}],"wp:attachment":[{"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/media?parent=51"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}