{"id":57,"date":"2022-03-15T15:19:58","date_gmt":"2022-03-15T14:19:58","guid":{"rendered":"https:\/\/leahall.fet.creativeschools.co.uk\/multi-agency-working\/"},"modified":"2023-06-26T14:21:29","modified_gmt":"2023-06-26T13:21:29","slug":"multi-agency-working","status":"publish","type":"page","link":"https:\/\/leahall.fet.ac\/parents\/joining-the-school\/multi-agency-working\/","title":{"rendered":"Multi-Agency Working"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">Physiotherapy<\/h2>\n\n\n\n<p><strong><em>Physiotherapy<\/em><\/strong> &#8211; is available to children who are assessed as needing it and NHS physiotherapy staff visit school at least weekly. &nbsp;Equipment is specifically purchased through the Primary Care Trust and every child who needs it has their own equipment in school. This might be for example, a specialist chair and tray to support learning in class and\/or a standing frame to practice weight bearing and standing. Some children may also have walking frames and specialist footwear as needed. Teachers and support staff in class are instructed in how to position children by the Physiotherapist or their assistant and they are then responsible for implementing any physiotherapy programmes. The Bridge School has a range of hoists to facilitate the safe manual handling of children and all staff physically assisting children with transfers are trained in the safe manual handling of children with special needs.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Speech and Language Therapy (SALT)<\/h2>\n\n\n\n<p><strong><em>Speech and Language Therapy (SALT)<\/em><\/strong> – is available to children who are assessed as needing it. Following a referral, Speech and Language Therapists will assess individual children and will write targets for them that are specific to their needs. &nbsp;Communication aids are developed for those children who are non-verbal. A range of systems of communication such as Makaton and PECS are used and at every opportunity, children are encouraged to be as independent as possible with their communication. NHS Speech and Language Therapists also support individual children experiencing difficulties with their eating and drinking (dysphagia).<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Occupational Therapy (OT)<\/h2>\n\n\n\n<p><strong><em>Occupational Therapy (OT)<\/em> –<\/strong> School liaises with professionals from different branches of OT. For assistance in obtaining special equipment or adaptations to your home, Occupational Therapy may be called upon from The Children’s Trust. Following a referral, Children’s Occupational Therapists visit school and assess and advise on individual children’s needs and how best to support them at home and at school.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Sensory Support Service<\/h2>\n\n\n\n<p><strong><em>Sensory Support Service <\/em>&#8211;<\/strong> For pupils who have impaired vision or hearing, teachers from the Specialist Support Service visit the school to assess pupils and provide advice on equipment and teaching methodology.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Behaviour and Autism Consultant<\/h2>\n\n\n\n<p><strong><em>Behaviour and Autism Consultant –<\/em><\/strong><em>&nbsp; <\/em>Supportive help is available to staff and parents of children with learning or behavioural difficulties through our Behaviour and Autism Consultant, Steve Brown who makes regular visits to the school.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">School Nurse<\/h2>\n\n\n\n<p>A school nurse is provided by the Birmingham Community Health NHS Trust and the school works closely with the allocated nurse.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">School Medical Clinics<\/h2>\n\n\n\n<p>Many parents\/carers choose to have their child’s medical needs monitored and reviewed by a paediatrician from Cottage Hospital (a school nurse will discuss this). The paediatrician, or ‘school doctor’ then holds regular clinics at school rather than at hospital, supported by a school nurse.<\/p>\n\n\n\n<p>Each pupil can expect to be seen at least once a year and parents are expected to attend. Parents may request more frequent appointments if they are in any way concerned as to their child&#8217;s medical condition or general health.<\/p>\n\n\n\n<p>The dietician, speech and language therapist and physiotherapist also hold routine clinics at the school, to review the progress of their patients.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">FAMILY SUPPORT SERVICE<\/h2>\n\n\n\n<p>For families who feel they require additional help Lea Hall Academy is able to signpost to services through a dedicated Family Support Worker. Our Family Support Worker will assess the family’s needs in line with Birmingham’s Right Help Right Time criteria and provide targeted support for an agreed period of time.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We work very closely with a range of visiting professionals at Lea Hall Academy and as appropriate to individual needs, our children and families are supported through:<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":47,"menu_order":7,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-57","page","type-page","status-publish","hentry"],"acf":{"sidebar":true,"landing_page":false},"_links":{"self":[{"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/pages\/57"}],"collection":[{"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/comments?post=57"}],"version-history":[{"count":6,"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/pages\/57\/revisions"}],"predecessor-version":[{"id":1369,"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/pages\/57\/revisions\/1369"}],"up":[{"embeddable":true,"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/pages\/47"}],"wp:attachment":[{"href":"https:\/\/leahall.fet.ac\/wp-json\/wp\/v2\/media?parent=57"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}